app/Controllers/AuthController.php

INSERT INTO `authors` (`username`, `email`, `password`, `phone_no`) VALUES ('Sonali', 'sonalii@gmail.com', '$2y$10$lIzgRZGX7rQIHvHHAXf.0uLt7w0zHF1tvI55/n8EkOhEnI22j483.', '9067352986')
---
            "phone_no" => $this->request->getVar('phone_no')
        ];

        if ($this->authmodel->save($AuthorizationData)) {