app/Models/FoodSearchModel.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
GROUP BY `products`.`product_id`, `product_prices`.`price`
) CI_count_all_results
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
GROUP BY `products`.`product_id`, `product_prices`.`price`
 LIMIT 10, 10
---
    public function findAllProducts($page = 1)
    {
        return $this->select('products.product_name as "Product Name",products.product_description as "Product Description",product_prices.price AS "Product Price",round(avg(ratings.rating_value),1) as "Product Average Rating",products.product_category as "Product Category",group_concat(toppings.topping_name , toppings_groups.group_name ) as "Product Customization",products.veg_non_veg as "Product Type"')
            ->join('product_prices', 'product_prices.product_id = products.product_id')
            ->join('ratings', 'ratings.product_id = products.product_id')
            ->join('product_toppings', 'product_toppings.product_id = products.product_id')
            ->join('toppings', 'toppings.topping_id = product_toppings.topping_id')
            ->join('toppings_groups', 'toppings_groups.group_id = toppings.group_id')
            ->groupBy('products.product_id,product_prices.price')
            ->paginate(10, 'default', $page);

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
GROUP BY `products`.`product_id`, `product_prices`.`price`
HAVING `product_prices`.`price` >= 200
AND `product_prices`.`price` <= 500
) CI_count_all_results
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
GROUP BY `products`.`product_id`, `product_prices`.`price`
HAVING `product_prices`.`price` >= 200
AND `product_prices`.`price` <= 1500
 LIMIT 10, 10
---
    public function filterPrice($minPrice, $maxPrice, $page)
    {
        return $this->select('products.product_name as "Product Name",products.product_description as "Product Description",product_prices.price AS "Product Price",round(avg(ratings.rating_value),1) as "Product Average Rating",products.product_category as "Product Category",group_concat(toppings.topping_name , toppings_groups.group_name ) as "Product Customization",products.veg_non_veg as "Product Type"')
            ->join('product_prices', 'product_prices.product_id = products.product_id')
            ->join('ratings', 'ratings.product_id = products.product_id')
            ->join('product_toppings', 'product_toppings.product_id = products.product_id')
            ->join('toppings', 'toppings.topping_id = product_toppings.topping_id')
            ->join('toppings_groups', 'toppings_groups.group_id = toppings.group_id')
            ->having('product_prices.price >=', $minPrice)
            ->having('product_prices.price <=', $maxPrice)
            ->groupBy('products.product_id,product_prices.price')
            ->paginate(10, 'default', $page);

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
GROUP BY `products`.`product_id`, `product_prices`.`price`
HAVING round(avg(ratings.rating_value),1) >= '4.2'
AND round(avg(ratings.rating_value),1) <= '4.5'
) CI_count_all_results
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
GROUP BY `products`.`product_id`, `product_prices`.`price`
HAVING round(avg(ratings.rating_value),1) >= '4.2'
AND round(avg(ratings.rating_value),1) <= '4.5'
 LIMIT 10, 10
---
    public function filterRatings($minRating, $maxRating, $page)
    {
        return $this->select('products.product_name as "Product Name",products.product_description as "Product Description",product_prices.price AS "Product Price",round(avg(ratings.rating_value),1) as "Product Average Rating",products.product_category as "Product Category",group_concat(toppings.topping_name , toppings_groups.group_name ) as "Product Customization",products.veg_non_veg as "Product Type"')
            ->join('product_prices', 'product_prices.product_id = products.product_id')
            ->join('ratings', 'ratings.product_id = products.product_id')
            ->join('product_toppings', 'product_toppings.product_id = products.product_id')
            ->join('toppings', 'toppings.topping_id = product_toppings.topping_id')
            ->join('toppings_groups', 'toppings_groups.group_id = toppings.group_id')
            ->having('round(avg(ratings.rating_value),1) >=', $minRating)
            ->having('round(avg(ratings.rating_value),1) <=', $maxRating)
            ->groupBy('products.product_id,product_prices.price')
            ->paginate(10, 'default', $page);

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
WHERE `products`.`product_category` IN ('rice','curry')
GROUP BY `products`.`product_id`, `product_prices`.`price`
) CI_count_all_results
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
WHERE `products`.`product_category` IN ('rice','curry')
GROUP BY `products`.`product_id`, `product_prices`.`price`
 LIMIT 10
---
    public function filterProducts($category, $page)
    {
        $categories = explode(',', $category);

        return $this->select('products.product_name as "Product Name",products.product_description as "Product Description",product_prices.price AS "Product Price",round(avg(ratings.rating_value),1) as "Product Average Rating",products.product_category as "Product Category",group_concat(toppings.topping_name , toppings_groups.group_name ) as "Product Customization",products.veg_non_veg as "Product Type"')
            ->join('product_prices', 'product_prices.product_id = products.product_id')
            ->join('ratings', 'ratings.product_id = products.product_id')
            ->join('product_toppings', 'product_toppings.product_id = products.product_id')
            ->join('toppings', 'toppings.topping_id = product_toppings.topping_id')
            ->join('toppings_groups', 'toppings_groups.group_id = toppings.group_id')
            ->whereIn('products.product_category', $categories)
            ->groupBy('products.product_id,product_prices.price')
            ->paginate(10, 'default', $page);

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
WHERE `toppings`.`topping_name` IN ('cheddar')
GROUP BY `products`.`product_id`, `product_prices`.`price`
) CI_count_all_results
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
WHERE `toppings`.`topping_name` IN ('cheddar')
GROUP BY `products`.`product_id`, `product_prices`.`price`
 LIMIT 10, 10
---
    public function filterToppings($toppings, $page)
    {
        $toppingvariable = explode(',', $toppings);
        return $this->select('products.product_name as "Product Name",products.product_description as "Product Description",product_prices.price AS "Product Price",round(avg(ratings.rating_value),1) as "Product Average Rating",products.product_category as "Product Category",group_concat(toppings.topping_name , toppings_groups.group_name ) as "Product Customization",products.veg_non_veg as "Product Type"')
            ->join('product_prices', 'product_prices.product_id = products.product_id')
            ->join('ratings', 'ratings.product_id = products.product_id')
            ->join('product_toppings', 'product_toppings.product_id = products.product_id')
            ->join('toppings', 'toppings.topping_id = product_toppings.topping_id')
            ->whereIn('toppings.topping_name', $toppingvariable)
            ->join('toppings_groups', 'toppings_groups.group_id = toppings.group_id')
            ->groupBy('products.product_id,product_prices.price')
            ->paginate(10, 'default', $page);

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
WHERE `products`.`veg_non_veg` IN ('veg')
GROUP BY `products`.`product_id`, `product_prices`.`price`
) CI_count_all_results
SELECT `products`.`product_name` as "Product Name", `products`.`product_description` as "Product Description", `product_prices`.`price` AS "Product Price", round(avg(ratings.rating_value), 1) as "Product Average Rating", `products`.`product_category` as "Product Category", group_concat(toppings.topping_name, toppings_groups.group_name ) as "Product Customization", `products`.`veg_non_veg` as "Product Type"
FROM `products`
JOIN `product_prices` ON `product_prices`.`product_id` = `products`.`product_id`
JOIN `ratings` ON `ratings`.`product_id` = `products`.`product_id`
JOIN `product_toppings` ON `product_toppings`.`product_id` = `products`.`product_id`
JOIN `toppings` ON `toppings`.`topping_id` = `product_toppings`.`topping_id`
JOIN `toppings_groups` ON `toppings_groups`.`group_id` = `toppings`.`group_id`
WHERE `products`.`veg_non_veg` IN ('veg')
GROUP BY `products`.`product_id`, `product_prices`.`price`
 LIMIT 10, 10
---
    public function filterType($type, $page)
    {
        $typevariable = explode(',', $type);
        return $this->select('products.product_name as "Product Name",products.product_description as "Product Description",product_prices.price AS "Product Price",round(avg(ratings.rating_value),1) as "Product Average Rating",products.product_category as "Product Category",group_concat(toppings.topping_name , toppings_groups.group_name ) as "Product Customization",products.veg_non_veg as "Product Type"')
            ->join('product_prices', 'product_prices.product_id = products.product_id')
            ->join('ratings', 'ratings.product_id = products.product_id')
            ->join('product_toppings', 'product_toppings.product_id = products.product_id')
            ->join('toppings', 'toppings.topping_id = product_toppings.topping_id')
            ->join('toppings_groups', 'toppings_groups.group_id = toppings.group_id')
            ->whereIn('products.veg_non_veg', $typevariable)
            ->groupBy('products.product_id,product_prices.price')
            ->paginate(10, 'default', $page);